# 25 pandas Tricks

In [1]:
import pandas as pd
import numpy as np

1. checking versions

In [2]:
pd.__version__

'0.24.2'

In [5]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit: None
python: 3.7.3.final.0
python-bits: 64
OS: Windows
OS-release: 10
machine: AMD64
processor: Intel64 Family 6 Model 78 Stepping 3, GenuineIntel
byteorder: little
LC_ALL: None
LANG: None
LOCALE: None.None

pandas: 0.24.2
pytest: 4.3.1
pip: 19.0.3
setuptools: 40.8.0
Cython: 0.29.6
numpy: 1.16.2
scipy: 1.2.1
pyarrow: None
xarray: None
IPython: 7.4.0
sphinx: 1.8.5
patsy: 0.5.1
dateutil: 2.8.0
pytz: 2018.9
blosc: None
bottleneck: 1.2.1
tables: 3.5.1
numexpr: 2.6.9
feather: None
matplotlib: 3.2.1
openpyxl: 2.6.1
xlrd: 1.2.0
xlwt: 1.3.0
xlsxwriter: 1.1.5
lxml.etree: 4.3.2
bs4: 4.7.1
html5lib: 1.0.1
sqlalchemy: 1.3.1
pymysql: None
psycopg2: None
jinja2: 2.10
s3fs: None
fastparquet: None
pandas_gbq: None
pandas_datareader: None
gcsfs: None

2.creating example of DataFrame

In [48]:
df=pd.DataFrame({'col_1':[100,200,300],'col_2':[101,202,303]})
df

   col_1  col_2
0    100    101
1    200    202
2    300    303

In [22]:
r=np.random.rand()  # randomly select 1 number from -1 to 1
r

0.9724130571973321

In [21]:
rr=np.random.randn(5) # here the last n is the number of elements we want 
rr                     # we have to pass the n as an argument

array([-0.14493751, -1.61506439,  1.59770676,  0.99377374, -0.69467947])

In [27]:
np.random.rand(3,5)

array([[0.16949038, 0.54049448, 0.37602065, 0.6710825 , 0.67490064],
       [0.85490837, 0.79858925, 0.32753509, 0.81154804, 0.43239931],
       [0.370523  , 0.13398495, 0.37451201, 0.61031044, 0.12980882]])

In [11]:
df=pd.DataFrame(np.random.rand(4,8))
df

,0,1,2,3,4,5,6,7
0,0.954479,0.843124,0.576151,0.258758,0.412790,0.038325,0.276739,0.271220
1,0.981055,0.853959,0.618729,0.083461,0.502485,0.359305,0.438859,0.293294
2,0.127818,0.094522,0.331325,0.570941,0.112104,0.749486,0.051853,0.731699
3,0.015049,0.431232,0.084666,0.989374,0.269407,0.191614,0.033289,0.533212

In [18]:
a=np.random.randint(1,100,32)
a

array([50, 25, 26, 83, 91, 70, 71, 87, 66, 94, 94,  2, 58, 98, 23, 10, 43,
       44, 72, 40,  8, 77, 64, 69, 71, 82, 30, 65, 94, 61, 46, 33])

In [16]:
b=np.arange(1,26)
b

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25])

array([ 0.045257  , -0.05096253,  0.19287768,  0.85940966,  0.35687791])

In [19]:
df=pd.DataFrame(a.reshape(4,8),columns=list('abcdefgh'))
df

    a   b   c   d   e   f   g   h
0  50  25  26  83  91  70  71  87
1  66  94  94   2  58  98  23  10
2  43  44  72  40   8  77  64  69
3  71  82  30  65  94  61  46  33

3.Rename columns

In [53]:
df.rename({'col_1':'col_one','col_2':'col_two'},axis=1,inplace=True)

In [56]:
df

   col_one  col_two
0      100      101
1      200      202
2      300      303

In [54]:
df.columns

Index(['col_one', 'col_two'], dtype='object')

In [55]:
df.columns.str.replace('_','')

Index(['colone', 'coltwo'], dtype='object')

In [58]:
df.add_prefix('x_')

   x_col_one  x_col_two
0        100        101
1        200        202
2        300        303

4.reverse row order

In [2]:
import seaborn as sns

In [3]:
dd=sns.load_dataset('tips')

In [4]:
dd.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [5]:
dd[0:2] # we can't filter for column here

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3

In [6]:
dd.iloc[0:2,2:4] # we can use iloc for column filter

      sex smoker
0  Female     No
1    Male     No

In [7]:
dd['sex']

0      Female
1        Male
2        Male
3        Male
4      Female
        ...
239      Male
240    Female
241      Male
242      Male
243    Female
Name: sex, Length: 244, dtype: category
Categories (2, object): ['Male', 'Female']

In [18]:
dd.loc[1:2,'sex'] # we should mention the column name , not the index value of column

1    Male
2    Male
Name: sex, dtype: category
Categories (2, object): ['Male', 'Female']

In [19]:
dd.loc[2:5,'sex':'day']

      sex smoker  day
2    Male     No  Sun
3    Male     No  Sun
4  Female     No  Sun
5    Male     No  Sun

In [70]:
dd.loc[::-1].head()

     total_bill   tip     sex smoker   day    time  size
243       18.78  3.00  Female     No  Thur  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
240       27.18  2.00  Female    Yes   Sat  Dinner     2
239       29.03  5.92    Male     No   Sat  Dinner     3

In [71]:
dd.loc[::-1].reset_index(drop=True).head() # it will set the row index from 0

   total_bill   tip     sex smoker   day    time  size
0       18.78  3.00  Female     No  Thur  Dinner     2
1       17.82  1.75    Male     No   Sat  Dinner     2
2       22.67  2.00    Male    Yes   Sat  Dinner     2
3       27.18  2.00  Female    Yes   Sat  Dinner     2
4       29.03  5.92    Male     No   Sat  Dinner     3

5.revese column order

In [72]:
dd.loc[:,::-1].head()

   size    time  day smoker     sex   tip  total_bill
0     2  Dinner  Sun     No  Female  1.01       16.99
1     3  Dinner  Sun     No    Male  1.66       10.34
2     3  Dinner  Sun     No    Male  3.50       21.01
3     2  Dinner  Sun     No    Male  3.31       23.68
4     4  Dinner  Sun     No  Female  3.61       24.59

6.select columns by data type

In [77]:
dd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null category
smoker        244 non-null category
day           244 non-null category
time          244 non-null category
size          244 non-null int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.2 KB

In [74]:
dd.select_dtypes(include='number').head()

   total_bill   tip  size
0       16.99  1.01     2
1       10.34  1.66     3
2       21.01  3.50     3
3       23.68  3.31     2
4       24.59  3.61     4

In [76]:
dd.select_dtypes(include='category').head()

      sex smoker  day    time
0  Female     No  Sun  Dinner
1    Male     No  Sun  Dinner
2    Male     No  Sun  Dinner
3    Male     No  Sun  Dinner
4  Female     No  Sun  Dinner

In [79]:
dd.select_dtypes(exclude='number').tail()

        sex smoker   day    time
239    Male     No   Sat  Dinner
240  Female    Yes   Sat  Dinner
241    Male    Yes   Sat  Dinner
242    Male     No   Sat  Dinner
243  Female     No  Thur  Dinner

7.convert string to numeric

In [3]:
dr=pd.DataFrame({'c1':['1','1.1','22'],'c2':['4.4','6.5','3.9'],'c3':['3,8975','2.2','-']})
dr

    c1   c2      c3
0    1  4.4  3,8975
1  1.1  6.5     2.2
2   22  3.9       -

In [4]:
dr.dtypes

c1    object
c2    object
c3    object
dtype: object

dr.astype({'c1':'float','c2':'float'}).dtypes

In [5]:
pd.to_numeric(dr.c3,errors='coerse')

0    NaN
1    2.2
2    NaN
Name: c3, dtype: float64

In [6]:
dr=dr.apply(pd.to_numeric,errors='coerse')
dr.dtypes

c1    float64
c2    float64
c3    float64
dtype: object

8.accessing few columns while reading files

In [7]:
b=pd.read_csv('Advertising.csv')
b.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [11]:
ad=pd.read_csv('Advertising.csv',usecols=['TV','Radio'])
ad.head()

      TV  Radio
0  230.1   37.8
1   44.5   39.3
2   17.2   45.9
3  151.5   41.3
4  180.8   10.8

9.split the dataframe in two random dataset

In [12]:
len(ad)

200

In [14]:
add=ad.sample(55)
add.head()        # we are getting 55 samples of the data

        TV  Radio
102  280.2   10.1
131  265.2    2.9
44    25.1   25.7
167  206.8    5.2
123  123.1   34.6

In [15]:
ad1=ad.sample(frac=0.75,random_state=6)

In [16]:
ad2=ad.drop(ad1.index)

In [17]:
len(ad1)+len(ad2)

200

10.filter a dataframe by multiple categories

In [19]:
dt=pd.read_csv('C:\\Users\\HP\\Downloads\\book.csv')
dt.head()

,bookID,title,authors,language_code
0,1,Harry Potter and the Half-Blood Prince (Harry ...,J.K. Rowling-Mary GrandPr,eng
1,2,Harry Potter and the Order of the Phoenix (Har...,J.K. Rowling-Mary GrandPr,eng
2,3,Harry Potter and the Sorcerer's Stone (Harry P...,J.K. Rowling-Mary GrandPr,eng
3,4,Harry Potter and the Chamber of Secrets (Harry...,J.K. Rowling,eng
4,5,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling-Mary GrandPr,eng

In [21]:
dt.language_code.unique()

array(['eng', 'en-US', 'spa', 'fre', 'en-GB', 'mul', 'ger', 'ara', 'por',
       'grc', 'en-CA', 'enm', 'jpn', 'dan', 'zho', 'nl', 'ita', 'lat',
       'srp', 'rus', '9.78067E+12', '9.78159E+12', 'tur', '9.78156E+12',
       'msa', 'swe', 'glg', 'cat', 'wel', 'heb', 'nor', '9.78186E+12',
       '9.78085E+12', 'gla', 'ale'], dtype=object)

In [25]:
dt[(dt.language_code=='eng')|(dt.language_code=='spa')|(dt.language_code=='fre')].head()

,bookID,title,authors,language_code
0,1,Harry Potter and the Half-Blood Prince (Harry ...,J.K. Rowling-Mary GrandPr,eng
1,2,Harry Potter and the Order of the Phoenix (Har...,J.K. Rowling-Mary GrandPr,eng
2,3,Harry Potter and the Sorcerer's Stone (Harry P...,J.K. Rowling-Mary GrandPr,eng
3,4,Harry Potter and the Chamber of Secrets (Harry...,J.K. Rowling,eng
4,5,Harry Potter and the Prisoner of Azkaban (Harr...,J.K. Rowling-Mary GrandPr,eng

In [31]:
dt[dt.language_code.isin(['eng','spa','fre'])].sample(6)

,bookID,title,authors,language_code
6797,21010,Spares,Michael Marshall Smith,eng
11623,39302,The Hunted (Vampire Huntress #3),L.A. Banks,eng
4031,12293,Education as My Agenda: Gertrude Williams Rac...,Jo Ann Ooiman Robinson,eng
12400,42536,Yanks: The Epic Story of the American Army in ...,John S.D. Eisenhower-Joanne Thompson Eisenhower,eng
7925,24812,The Complete Calvin and Hobbes,Bill Watterson,eng
5722,17011,A Devilish Dilemma,Judith A. Lansdowne,eng

In [33]:
dt[~dt.language_code.isin(['eng','spa','fre'])].sample(5)

,bookID,title,authors,language_code
524,1516,Aeschylus I: Oresteia (Agamemnon The Libation...,Aeschylus-David Grene-Richmond Lattimore,en-US
9742,31352,Songmaster,Orson Scott Card,en-US
4086,12473,The Big Empty: Dialogues on Politics Sex God...,Norman Mailer-John Buffalo Mailer,en-US
6238,18699,My Life,Bill Clinton,en-US
12336,42205,Invisible Cities,Italo Calvino-William Weaver,en-US

11.filter a dataframe by largest categories

In [35]:
count=dt.language_code.value_counts()
count

eng            10594
en-US           1699
spa              419
en-GB            341
ger              238
fre              209
jpn               64
por               27
mul               21
ita               19
zho               16
grc               12
en-CA              9
rus                7
nl                 7
swe                6
glg                4
tur                3
enm                3
cat                3
lat                3
ara                2
nor                1
ale                1
dan                1
9.78159E+12        1
srp                1
9.78067E+12        1
9.78156E+12        1
9.78186E+12        1
gla                1
msa                1
heb                1
9.78085E+12        1
wel                1
Name: language_code, dtype: int64

In [37]:
count.nlargest(3)

eng      10594
en-US     1699
spa        419
Name: language_code, dtype: int64

In [39]:
count.nlargest(3).index

Index(['eng', 'en-US', 'spa'], dtype='object')

In [41]:
dt[dt.language_code.isin(count.nlargest(3).index)].sample(5)

,bookID,title,authors,language_code
9253,29923,The Last Full Measure (The Civil War Trilogy #3),Jeff Shaara,eng
972,2866,Girl With a Pearl Earring,Tracy Chevalier,eng
12120,41468,Dewdrops on a Lotus Leaf: Zen Poems of Ryokan,Rykan-John Stevens,eng
488,1433,Hamlet,William Shakespeare-Stephen Orgel-A.R. Braunmu...,eng
9489,30512,Paddy Clarke Ha Ha Ha,Roddy Doyle,eng

12.split a string into multiple column

In [23]:
df2=pd.DataFrame({'name':['Jhon Arthor Deo','Jane Ane Smith'],
                  'location':['Los Ang','wasington']})
df2

              name   location
0  Jhon Arthor Deo    Los Ang
1   Jane Ane Smith  wasington

In [25]:
df2.name.str.split(' ',expand=True)

      0       1      2
0  Jhon  Arthor    Deo
1  Jane     Ane  Smith

In [48]:
df2[['fname','mname','lname']]=df2.name.str.split(' ',expand=True)

In [49]:
df2

              name   location fname   mname  lname
0  Jhon Arthor Deo    Los Ang  Jhon  Arthor    Deo
1   Jane Ane Smith  wasington  Jane     Ane  Smith

13.expand a series of list into dataframe

In [56]:
dff=pd.DataFrame({'col1':['a','b','c','d'],'col2':[[10,20],[30,40],[50,60],[70,80]]})
dff

  col1      col2
0    a  [10, 20]
1    b  [30, 40]
2    c  [50, 60]
3    d  [70, 80]

In [59]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
col1    4 non-null object
col2    4 non-null object
dtypes: object(2)
memory usage: 144.0+ bytes

In [63]:
dff_=dff.col2.apply(pd.Series)
dff_

    0   1
0  10  20
1  30  40
2  50  60
3  70  80

In [64]:
pd.concat([dff,dff_],axis=1)

  col1      col2   0   1
0    a  [10, 20]  10  20
1    b  [30, 40]  30  40
2    c  [50, 60]  50  60
3    d  [70, 80]  70  80

14.Aggregate by multiple function

In [3]:
tip=sns.load_dataset('tips')
tip.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [69]:
#to find the total bill on sunday
tip[tip.day=='Sun'].total_bill.sum()

1627.16

In [70]:
tip.groupby('day').total_bill.sum()

day
Thur    1096.33
Fri      325.88
Sat     1778.40
Sun     1627.16
Name: total_bill, dtype: float64

In [72]:
tip.groupby('day').total_bill.agg(['sum','count','mean','max','min'])

          sum  count       mean    max   min
day
Thur  1096.33     62  17.682742  43.11  7.51
Fri    325.88     19  17.151579  40.17  5.75
Sat   1778.40     87  20.441379  50.81  3.07
Sun   1627.16     76  21.410000  48.17  7.25

15.combine the aggregate output with the dataframe

In [73]:
len(tip.groupby('day').total_bill.sum())

4

In [74]:
len(tip.total_bill)

244

In [75]:
total_price_allday= tip.groupby('day').total_bill.transform('sum')
len('total_price_allday')

18

In [76]:
tip['total_price_allday']=total_price_allday

In [77]:
tip.head()

   total_bill   tip     sex smoker  day    time  size  total_price_allday
0       16.99  1.01  Female     No  Sun  Dinner     2             1627.16
1       10.34  1.66    Male     No  Sun  Dinner     3             1627.16
2       21.01  3.50    Male     No  Sun  Dinner     3             1627.16
3       23.68  3.31    Male     No  Sun  Dinner     2             1627.16
4       24.59  3.61  Female     No  Sun  Dinner     4             1627.16

In [84]:
tip['percent of total price']=tip.total_price_allday/tip.total_bill.sum()

In [85]:
tip.head()

,total_bill,tip,sex,smoker,day,time,size,total_price_allday,percent of total price
0,16.99,1.01,Female,No,Sun,Dinner,2,1627.16,0.337042
1,10.34,1.66,Male,No,Sun,Dinner,3,1627.16,0.337042
2,21.01,3.50,Male,No,Sun,Dinner,3,1627.16,0.337042
3,23.68,3.31,Male,No,Sun,Dinner,2,1627.16,0.337042
4,24.59,3.61,Female,No,Sun,Dinner,4,1627.16,0.337042

16.Reshape a multindex series

In [5]:
tip.groupby('sex').total_bill.mean()

sex
Male      20.744076
Female    18.056897
Name: total_bill, dtype: float64

In [6]:
tip.groupby(['sex','day']).total_bill.mean()

sex     day
Male    Thur    18.714667
        Fri     19.857000
        Sat     20.802542
        Sun     21.887241
Female  Thur    16.715312
        Fri     14.145556
        Sat     19.680357
        Sun     19.872222
Name: total_bill, dtype: float64

In [7]:
tip.groupby(['sex','day']).total_bill.mean().unstack()

day          Thur        Fri        Sat        Sun
sex
Male    18.714667  19.857000  20.802542  21.887241
Female  16.715312  14.145556  19.680357  19.872222

17.Create a pivot table

In [8]:
tip.pivot_table(index='sex',columns='day',values='total_bill',aggfunc='mean')

day          Thur        Fri        Sat        Sun
sex
Male    18.714667  19.857000  20.802542  21.887241
Female  16.715312  14.145556  19.680357  19.872222

In [11]:
tip.pivot_table(index='sex',columns='day',values='total_bill',aggfunc='count',margins=True)

day     Thur  Fri  Sat  Sun  All
sex
Male      30   10   59   58  157
Female    32    9   28   18   87
All       62   19   87   76  244

18.convert continous data into categorical data

In [3]:
tt=pd.read_csv('C://users//HP//Downloads//Titanictrain.csv')
tt.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
tt.Age.dtypes

dtype('float64')

In [3]:
tt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
tt['agebin'] = pd.cut(tt['Age'],bins=[0,18,25,99])
tt.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,age_bucket,agebin
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,category,"(18, 25]"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,category,"(25, 99]"
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,category,"(25, 99]"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,category,"(25, 99]"
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,category,"(25, 99]"

In [12]:
tt['age bucket'] = pd.cut(tt['Age'],bins=[0,18,25,99],labels=['child','young_adult','adult'])

In [11]:
pd.cut(tt.Age,bins=[0,18,25,99],labels=['child','young_adult','adult']).dtypes

CategoricalDtype(categories=['child', 'young_adult', 'adult'], ordered=True)

In [13]:
tt.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,age_bucket,agebin,age bucket
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,category,"(18, 25]",young_adult
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,category,"(25, 99]",adult
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,category,"(25, 99]",adult
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,category,"(25, 99]",adult
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,category,"(25, 99]",adult

In [ ]:
tt.pivot_table

In [19]:
tt['Name'][tt.Pclass==1][tt.Sex=='female'] #'Pclass'=1]]

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
11                              Bonnell, Miss. Elizabeth
31        Spencer, Mrs. William Augustus (Marie Eugenie)
52              Harper, Mrs. Henry Sleeper (Myna Haxtun)
                             ...
856           Wick, Mrs. George Dennick (Mary Hitchcock)
862    Swift, Mrs. Frederick Joel (Margaret Welles Ba...
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
887                         Graham, Miss. Margaret Edith
Name: Name, Length: 94, dtype: object

In [27]:
tt[tt['Pclass']==1][tt['Sex']=='female']['Name'] #& tt['Sex']=='female']

<ipython-input-27-21e5a2b5423e>:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  tt[tt['Pclass']==1][tt['Sex']=='female']['Name'] #& tt['Sex']=='female']

1      Cumings, Mrs. John Bradley (Florence Briggs Th...
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
11                              Bonnell, Miss. Elizabeth
31        Spencer, Mrs. William Augustus (Marie Eugenie)
52              Harper, Mrs. Henry Sleeper (Myna Haxtun)
                             ...
856           Wick, Mrs. George Dennick (Mary Hitchcock)
862    Swift, Mrs. Frederick Joel (Margaret Welles Ba...
871     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
879        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
887                         Graham, Miss. Margaret Edith
Name: Name, Length: 94, dtype: object

In [7]:
import pandas as pd

In [2]:
ll=[(1,2,3),(3,6,8),(5,8,3)]
dd=pd.DataFrame(ll,columns=['a','b','c'])
dd

   a  b  c
0  1  2  3
1  3  6  8
2  5  8  3

In [3]:
l=[[1,2,3], [4,5,6], [7], [8,9]]
sum(l,[])

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [9]:
ll=[1,2,3,4,5,6,7,8]
i=0
nl=[]
while i<len(ll):
    nl.append(ll[i:i+2])
    i=i+2
nl

[[1, 2], [3, 4], [5, 6], [7, 8]]

In [10]:
import sqlalchemy

In [5]:
sttr='this is a string'
sttr.index('str')

10

In [14]:
a=','
a.join('qe')

'q,e'

In [2]:
w=[2,3,4,5,6,7,8,9]
l=[x**2 for x in w]
l

[4, 9, 16, 25, 36, 49, 64, 81]

In [3]:
a=list(map(lambda x:x**2,w))

In [4]:
a

[4, 9, 16, 25, 36, 49, 64, 81]

In [12]:
dd['a'] = dd['a'].map(lambda x:x+2)

In [13]:
dd['a']

0    3
1    5
2    7
Name: a, dtype: int64

In [14]:
dd['a']=dd['a'].apply(lambda x:x+2)

In [15]:
dd['a']

0    5
1    7
2    9
Name: a, dtype: int64

dd['a']=dd['a'].applymap(lambda x:x+2)
dd['a']              # its a dataframe attribute not of series

In [17]:
dd['a'] = pd.Series(map(lambda x:x+2,dd['a']))

In [18]:
dd['a']

0     7
1     9
2    11
Name: a, dtype: int64